app/controllers/teachers_controller.rb

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @teacher = Teacher.new(params[:teacher])

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("address", "alias_name", "comment", "created_at", "deleted", "email", "first_name", "image_url", "last_name", "mobile", "position", "postcode", "pwd", "regist_name", "resume", "telephone", "title", "updated_at", "valid_certificate", "valid_certificate_no") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @teacher = Teacher.find(params[:id])

    # if params[:teacher][:avatar] && @teacher. avatar
      # old_avatar = @teacher.avatar
    # end

    respond_to do |format|
      if @teacher.update_attributes(params[:teacher])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "teachers" SET "postcode" = '100000', "resume" = '由于Web2.0技术的成型，世界目睹了人类知识存储和共享方式的改革性变化。基于Web的工具，提供创新的方法来解决在每日生活中，最重要的是在教育的日常活动。当前的教育技术特别是能够实现有利于协同讨论的沟通，交换意见和批判性思维。现在在互联网上有几个平台，在能够以讨论区、博客，甚至是视频/音频会议的形式提供这样的机会（Saeed, Young,& Sinnappon, 2009）。这些平台就是所谓的社交网站（SNS网站）。这些SNS网站中许多是免费的，并且不需要复杂的电脑编程技巧（Richardson, 2010），并且不像其他通信媒体，如电子邮件，社交网站公开延伸到了在一个单一的虚拟位置的个人（Richardson, 2010）。', "comment" = '为了使你了解你如何在你的教学中使用社交媒体，我跟大家分享一些图片，举出几点如何在你的课堂上利用SNS网站的小技巧。', "updated_at" = '2013-06-13 05:04:09.880400' WHERE "teachers"."id" = 1