app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 5)
---
SELECT "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)